In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
#printing dataframe
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
# Filling Missing Values as per condition given 
for i in range(1,df.shape[0]):
    if pd.isnull(df.loc[i,'FlightNumber']):
        df.loc[i,'FlightNumber']=df.loc[i-1,'FlightNumber']+10
df['FlightNumber']=df['FlightNumber'].astype(int)   # converting Datatype into int

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [6]:
# data type check for FlightNumber
df['FlightNumber'].dtypes

dtype('int32')

In [7]:
temp=df[['From_To']].copy()   # creating temporary copy of Datarame

In [8]:
temp[['From','To']]=temp['From_To'].str.split(pat='_',n=2,expand=True)   # splitting the From_To column into From and To column respectively in temp df

In [9]:
# To capitalize location names
temp['To']=temp['To'].str.capitalize()
temp['From']=temp['From'].str.capitalize()

In [10]:
temp

            From_To      From         To
0      LoNDon_paris    London      Paris
1      MAdrid_miLAN    Madrid      Milan
2  londON_StockhOlm    London  Stockholm
3    Budapest_PaRis  Budapest      Paris
4   Brussels_londOn  Brussels     London

In [11]:
# removing From_To column and adding From and To from temp Dataframe to actual one
df.drop(columns='From_To',inplace=True)
df.insert(0,'From',temp['From'])
df.insert(1,'To',temp['To'])
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [12]:
# converting into subsequent no. of columns
sub_df=df['RecentDelays'].apply(pd.Series)

In [13]:
# creating column headers
dic={}
for i in range(0,sub_df.columns[-1]+1):
    dic[sub_df.columns[i]]='delay_'+str(i+1)

In [14]:
# setting column headers
sub_df.rename(columns=dic,inplace=True)

In [15]:
sub_df

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [16]:
# dropping RecentDelays column 
df.drop('RecentDelays',inplace=True,axis=1)

In [17]:
# concat df and sub_df into df
df=pd.concat([df,sub_df],axis=1)

In [18]:
df

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN

In [19]:
# Reordering the columns
cols=['From','To','FlightNumber','delay_1','delay_2','delay_3','Airline']
df=df[cols]

In [20]:
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,"""Swiss Air"""